test/load/websocketTest.yaml
config:
  target: "ws://localhost:8080/entry"
  processor: "./websocketTest.js"

  ensure:
    p95: 200
    maxErrorRate: 1

  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 5
      name: "Warming up"
    - duration: 240
      arrivalRate: 5
      rampTo: 40
      name: "Max load"
      
  ws:
    subprotocols:
      - json
    headers:
      Connection: Upgrade
      Origin: http://localhost:8080
      Sec-WebSocket-Version: 13
      
scenarios:
  - engine: "ws"
    flow:
    - function: "createTestMessageObject"
    - send: "{{ data }}"
    - think: 30 # Each client should stay connected for 30 seconds